# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

# ['213213', 'dsf653', 'dsf', 'fdh76']
# num = 3
# Вывод: '213213', 'dsf653'


# def find_num(lst: list[str], num: str):
#     for i in range(len(lst)):
#         if num in lst[i]:
#             print(lst[i])


# lst = ['213213', 'dsf653', 'dsf', 'fdh76']
# num = input('Введите искомое значение: ')
# find_num(lst, num)



